app/views/templates/index.html.erb

              <td class="border border-gray-300 px-6 py-3 text-center">
                <% if template.forms.any? %>
---
SELECT 1 AS one FROM "forms" WHERE "forms"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]