app/views/templates/show.html.erb

SELECT COUNT(*) FROM "forms" WHERE "forms"."template_id" = ?  [["template_id", 1]]
---
          <strong>Formulários vinculados:</strong>
          <%= @template.forms.count %>

SELECT 1 AS one FROM "forms" WHERE "forms"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
---

        <% if @template.forms.any? %>