app/views/responses/_form.html.erb

SELECT "forms".* FROM "forms"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <%= form.label :form_id, "Formulário", style: "display: block" %>
    <%= form.collection_select :form_id, ::Form.all, :id, :title, prompt: "Selecione o Formulário" %>
  </div>
  <%= form.hidden_field :user_id, value: form.object.user_id || ::User.first&.id || ::User.create!(name: "Participante", email: "part@example.com").id %>