app/views/forms/_form.html.erb

    <%= f.label :template_id, "Template", style: "display: block" %>
    <%= f.collection_select :template_id, ::Template.all, :id, :name, prompt: "Selecione" %>
---
SELECT "templates".* FROM "templates"