app/views/forms/index.html.erb


  <% available_forms = @forms.select { |f| f.responses.where(user: current_user).empty? } %>
---
SELECT 1 AS one FROM "responses" WHERE "responses"."form_id" = ? AND "responses"."user_id" = ? LIMIT ?  [["form_id", 1], ["user_id", 1], ["LIMIT", 1]]