app/controllers/forms_controller.rb

SELECT "forms".* FROM "forms"
---
  def index
    @forms = Form.all

INSERT INTO "forms" ("title", "template_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Turma de Engenharia de Software"], ["template_id", 1], ["created_at", "2026-06-10 17:11:53.710778"], ["updated_at", "2026-06-10 17:11:53.710778"]]
---
  def create
    @form = Form.new(form_params)

    respond_to do |format|
      if @form.save

SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_form
      @form = Form.find(params.expect(:id))