app/controllers/imports_controller.rb

INSERT INTO "users" ("name", "email", "role", "password_digest", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    file = params[:file]
    if file && file.original_filename.end_with?('.csv')
      User.create!(name: "João", email: "joao@example.com", status: 'pre-cadastrado')