app/controllers/passwords_controller.rb

  def edit
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:user_id])
    if params[:password].length >= 8 && params[:password] == params[:password_confirmation]
      @user.update!(status: 'ativo')
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", "ativo"], ["updated_at", "2026-06-10 03:13:04.332907"], ["id", 1]]