app/controllers/reports_controller.rb

SELECT "responses".* FROM "responses"
---
  def index
    if params[:turma] == "Turma de Algoritmos"
      flash.now[:alert] = "Dados insuficientes para gerar o relatório desta turma"
    elsif params[:turma].present?
      @responses = Response.all