app/controllers/responses_controller.rb

INSERT INTO "responses" ("form_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["form_id", 1], ["user_id", 1], ["content", "Minha resposta completa"], ["created_at", "2026-06-10 17:04:14.781772"], ["updated_at", "2026-06-10 17:04:14.781772"]]
---
  def create
    @response = Response.new(response_params)

    respond_to do |format|
      if @response.save

SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_response
      @response = Response.find(params.expect(:id))