app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates"
---
  def index
    @templates = Template.all

INSERT INTO "templates" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Avaliação Padrão"], ["description", "Questões variadas"], ["created_at", "2026-06-10 17:11:54.529803"], ["updated_at", "2026-06-10 17:11:54.529803"]]
---
  def create
    @template = Template.new(template_params)

    respond_to do |format|
      if @template.save

UPDATE "templates" SET "name" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["name", "Avaliação Semestral"], ["updated_at", "2026-06-15 22:46:56.390789"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @template.update(template_params)

SELECT 1 AS one FROM "forms" WHERE "forms"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
---
  def destroy
    if @template.forms.any?

SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_template
      @template = Template.find(params.expect(:id))